# 04 - Grouping

### Step 1. Import the necessary libraries

In [12]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [13]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### Step 4. Which continent drinks more beer on average?

In [18]:
drinks.groupby("continent")["beer_servings"].mean().sort_values(ascending=False)

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [6]:
drinks.groupby("continent")["wine_servings"].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [19]:
drinks.groupby("continent").mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [20]:
drinks.groupby("continent").median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.

In [23]:
drinks["spirit_servings"].describe()

count    193.000000
mean      80.994819
std       88.284312
min        0.000000
25%        4.000000
50%       56.000000
75%      128.000000
max      438.000000
Name: spirit_servings, dtype: float64

In [25]:
drinks.groupby("continent")["spirit_servings"].agg(["mean","min", "max"])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

In [26]:
drinks.groupby("spirit_servings").agg(["mean","min", "max"])

                beer_servings           wine_servings           \
                         mean  min  max          mean min  max
spirit_servings
0                   16.521739    0   92     16.565217   0  233
1                   33.333333    1  147      3.666667   0    9
2                   47.285714    3  111      3.571429   0   19
3                   68.125000    1  376      4.375000   0   20
4                   17.666667    6   34      4.666667   0   13
...                       ...  ...  ...           ...  ..  ...
302                 93.000000   93   93      1.000000   1    1
315                171.000000  171  171     71.000000  71   71
326                124.000000    1  247     37.000000   1   73
373                142.000000  142  142     42.000000  42   42
438                199.000000  199  199     28.000000  28   28

                total_litres_of_pure_alcohol
                                        mean   min   max
spirit_servings
0                                   1.026087   0.0   6.3
1                                   1.455556   0.1   5.8
2                                   2.471429   0.1   6.8
3                                   2.487500   0.1   6.8
4                                   0.533333   0.2   1.1
...                                      ...   ...   ...
302                                 7.100000   7.1   7.1
315                                10.100000  10.1  10.1
326                                 8.700000   5.9  11.5
373                                14.400000  14.4  14.4
438                                11.900000  11.9  11.9

[109 rows x 9 columns]

In [28]:
drinks.groupby.index["spirit_servings"].agg(["mean","min", "max"])

AttributeError: 'function' object has no attribute 'index'